simulation/deltaTheta_180/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water oil);

water
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1e-7;
    rho             rho [1 -3 0 0 0 0 0] 1000;
}

oil
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1e-4;
    rho             rho [1 -3 0 0 0 0 0] 1000;
}

sigma           sigma [1 0 -2 0 0 0 0] 0.07;


// ************************************************************************* //
