simulation/deltaTheta_180/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; //e-3;

vertices
(
	(-1e-4 2e-4 -2.e-5)
	(40e-3 2e-4 -2.e-5)
	(40e-3 18.4e-3 -2e-5)
	(-1e-4 18.4e-3 -2.e-5)

        (-1e-4 2e-4 2.e-5)
        (40e-3 2e-4 2.e-5)
        (40e-3 18.4e-3 2.e-5)
        (-1e-4 18.4e-3 2.e-5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4010 1820 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inletB
    {
        type patch;
        faces
        (
            (3 0 4 7)
        );
    }
    outletB
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    wallsB
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
    frontAndBack
    {
	type empty;
	faces
	(
	    (2 1 0 3)
	    (5 6 7 4)
	);
    }
);

// ************************************************************************* //
